#include "arablang.h"

هيكل Student
بدء
	العددالصحيح id;	
	الاحرف name;
	الكذبالحقيقي isDead = خطأ;
النهاية;

العددالصحيح AddNum(العددالصحيح _a, العددالصحيح _b)
بدء
	أعاد _a + _b;
النهاية

دالة ForFunc() 
بدء
	تكرار(العددالصحيح i = 0; i صغير 3; ++i)
	بدء
		تكرار	(العددالصحيح j = 0; j صغير 5; ++j) بدء
			إطلاقالطاقة << '*';
		النهاية		
	إطلاقالطاقة << انتهاء;	
	النهاية
النهاية

العددالصحيح وسط()
بدء
	Student stu[2] =
	بدء
		{1234, "Kim", خطأ},
		{5678, "Choi", صحيح}
	النهاية;

	ForFunc();

	العددالصحيح a = إنهفارغ;
	العددالصحيح b = إنهفارغ;

	إطلاقالمدخلات >> a >> b;
	إطلاقالطاقة << AddNum(a, b) << انتهاء;

	تكرار(العددالصحيح i = 0; i صغير 2; i++) بدء
		إطلاقالطاقة << stu[i].id << stu[i].name << انتهاء;
		إطلاقالطاقة << "isDead : " << stu[i].isDead << انتهاء;
	النهاية

	ماذالو(stu[0].id أكبرأويساوي stu[1].id) بدء
		إطلاقالطاقة << "Wow" << انتهاء;
	النهاية

	العددالصحيح count = 0;

	اللانهاية(صحيح) بدء
		ماذالو(count أكبرأويساوي 30)
		بدء
			طريقمسدود;
		النهاية
		اخر
		بدء
			count++;
			إطلاقالطاقة << count;
		النهاية
	النهاية

	أعاد 0;
النهاية
